#Область ПОЛЬЗ0

Функция ИмяБлокаПОЛЬЗ0() Экспорт
	
	Возврат "ПОЛЬЗ0";
	
КонецФункции

Функция ТекстЗаголовкаПОЛЬЗ0() Экспорт	
	Возврат НСтр("ru = 'Погодка 2.0'");
КонецФункции

Функция Обновление_ПОЛЬЗ0(стПараметры) Экспорт
	
КонецФункции

#КонецОбласти

#Область ПОЛЬЗ1

Функция ИмяБлокаПОЛЬЗ1() Экспорт
	
	Возврат "ПОЛЬЗ1";
	
КонецФункции

Функция ТекстЗаголовкаПОЛЬЗ1() Экспорт
	
	Возврат НСтр("ru = 'Виджет пользователя 02'");
	
КонецФункции

Функция Обновление_ПОЛЬЗ1(стПараметры) Экспорт
	
КонецФункции

#КонецОбласти

#Область ПОЛЬЗ2

Функция ИмяБлокаПОЛЬЗ2() Экспорт
	
	Возврат "ПОЛЬЗ2";
	
КонецФункции

Функция ТекстЗаголовкаПОЛЬЗ2() Экспорт
	
	Возврат НСтр("ru = 'Виджет пользователя 03'");
	
КонецФункции

Функция Обновление_ПОЛЬЗ2(стПараметры) Экспорт
	
КонецФункции

#КонецОбласти
